#include <iostream> // подкл-е биб-и ввода/вывода
#include <vector> // подкл-е биб-и для работы с динамическим массивом векторами
#include <clocale> // подкл-е биб-и для локализации
using namespace std; // испол-м стандартное пр-во имен

bool isSafe(int v, const vector<vector<int>>& graph, const vector<int>& color, int c) { // фун-я для проверки можно ли покрасить вершину v в цвет безопасно
    for (int i = 0; i < graph.size(); ++i) { // проходит циклом по всем вершинам графа
        if (graph[v][i] && color[i] == c) { //graph=1 означ. что вершины соед,а color=с что уже  покрашен в этот цвет
        return false;
        }
    }
    return true; //если конфликтов нет цвет подходит
}
//рекурсивная фун поиска  раскраски (метод перебора с возвратом
bool graphColoringUtil(const vector<vector<int>>& graph, int k, vector<int>& color, int v) {
    if (v == graph.size()) { // если дошли до конца то все вершины покрашены
        return true;
    }

    for (int c = 1; c <= k; ++c) { // пробуем по очерили все доступные цвета от 1 до K
        if (isSafe(v, graph, color, c)) { // проверям безопасен ли выбранный цвет
            color[v] = c;//временно присваиваем этот цвет вершине

            if (graphColoringUtil(graph, k, color, v + 1)) { //рекурсивно вызываем фун для след вершины v+1
                return true; // если дальше все покрасилось успешно возврашаем true
            }

            color[v] = 0;//  если путь привел к тупику  сбрасываем  цвет обпатно в 0
        }
    }

    return false; //если ни один цвет не подошел
}

bool graphColoring(const vector<vector<int>>& graph, int k) { //основная фун которая запкускает алгоритм и вывожит результат
    int n = graph.size();//узнаем количество вершин в графе
    vector<int> color(n, 0);//создаем массив цветов и заполняем его нулями 0-не покрашена 1-покрашена

    if (!graphColoringUtil(graph, k, color, 0)) {//запускаем рекурсию с нулевой вершины. если решение не найдено пишем
        cout << "Решение не найдено: нельзя раскрасить граф в " << k << " цветов.\n";
        return false;
    }

    cout << "Граф успешно раскрашен в " << k << " цветов. Цвета вершин:\n";//если решение найдено выводим его на экран
    for (int i = 0; i < n; ++i) {
        cout << "Вершина " << i << " -> Цвет " << color[i] << "\n";
    }
    return true;
}

int main() {//галавная фун прог точка входа
    setlocale(LC_ALL, "Russian");//настраиваем кирилицу для правильного отображения в консоли

    vector<vector<int>> graph = {//задаем граф смежности допстим в нашем случае для 4 вершин
        {0, 1, 1, 1},
        {1, 0, 1, 0},
        {1, 1, 0, 1},
        {1, 0, 1, 0}
    };

    int k = 3; //задаем кол-во доступных нам цветов допустим 3

    graphColoring(graph, k);//запускаем функцию раскраски графа

    cin.get();//чтобы окно не закрывалось сразу
    return 0;//завершение программы
}
